/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Åtgärden kunde inte slutföras";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Ett okänt fel inträffade: %d"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Kan inte slutföra åtgärden";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Försök igen senare.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Kan inte spela in";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Försök att spela in igen.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Kan inte spela in";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Stoppa alla andra åtgärder som använder %@ och försök igen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Kan inte spela in";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Försök att spela in igen.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Försök att spela in igen.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Det finns inte tillräckligt med ledigt utrymme för att fortsätta skriva filen. Frigör utrymme genom att radera befintliga videor eller bilder.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Försök att spela in igen.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Försök att spela in igen.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Inspelningen har uppnått den maximalt tillåtna längden."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Inspelningen har uppnått den maximalt tillåtna filstorleken."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Stoppa alla andra åtgärder som använder inspelningsenheten och försök igen.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Inspelningen har uppnått den maximalt tillåtna längden."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Kan inte spela in";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Försök att spela in igen.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Kan inte använda %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Stoppa alla andra åtgärder som använder %@ och försök igen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Kan inte använda %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Stoppa alla andra åtgärder som använder %@ och försök igen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Inspelningen stoppad";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Stoppa alla andra åtgärder som använder inspelningsenheten och försök igen.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Lampan kunde inte tändas.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Försök med att sänka lampans nivå.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Kan inte slutföra åtgärden";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Försök igen senare.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Kan inte slutföra export";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Försök exportera igen.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Kan inte avkoda";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Mediets data kunde inte avkodas. Det kan vara skadat.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Medieformatet stöds inte.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Kan inte spara";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Försök spara igen.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Kan inte skriva utdatafil";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Ändra utdatatillägget och försök igen.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Mediet kan inte användas.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Mediet kan inte användas.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Mediet kan inte användas.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Mediet kan inte användas.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Medieformatet stöds inte.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Mediet kan vara skadat.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Kan inte ta bild";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Försök att ta en bild igen.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Åtgärden stöds inte för skyddat innehåll."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Innehållet är inte auktoriserat."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Det här programmet är inte auktoriserat att spela upp filen."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Mediet kan inte användas.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Kan inte avkoda";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Den avkodare som krävs för det här mediet hittades inte.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Kan inte koda";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Den kodare som krävs för det här mediet hittades inte.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Kan inte avkoda";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Den avkodare som krävs för det här mediet är upptagen.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Stoppa alla andra åtgärder som avkodar medier och försök igen.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Kan inte koda";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Den kodare som krävs för det här mediet är upptagen.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Stoppa alla andra åtgärder som kodar medier och försök igen.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Kan inte använda %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@ får inte användas av ett program som körs i bakgrunden."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Åtgärden stöds inte för det här mediet.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Videon kunde inte komponeras enligt de angivna instruktionerna.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Mediet kan inte användas.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Cache-filen på hämtningens mål-URL kan inte användas.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "Filen har en ogiltig kontrollsumma.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Åtgärden avbröts";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Stoppa andra åtgärder och försök igen.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Kan inte öppna";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Mediet kan inte användas på den här enheten.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Mediet kan vara skadat.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Åtgärden stoppades";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Servern är inte korrekt inställd.";
